In [1]:
import pandas as pd
import numpy as np
print("Setup complete")

Setup complete

In [3]:
r = np.arange(0,2,0.2)
r

array([0. , 0.2, 0.4, 0.6, 0.8, 1. , 1.2, 1.4, 1.6, 1.8])

In [4]:
ser = pd.Series(r)

In [5]:
ser

0    0.0
1    0.2
2    0.4
3    0.6
4    0.8
5    1.0
6    1.2
7    1.4
8    1.6
9    1.8
dtype: float64

In [6]:
ser.sum()

9.000000000000002

In [7]:
ser.mean()

0.9000000000000001

In [8]:
ser.describe()

count    10.00000
mean      0.90000
std       0.60553
min       0.00000
25%       0.45000
50%       0.90000
75%       1.35000
max       1.80000
dtype: float64

In [10]:
df1 = pd.DataFrame({'A':ser[:4]+1,'B':ser[4:]+2}).fillna({'A':1,'B':2})
df1

     A    B
0  1.0  2.0
1  1.2  2.0
2  1.4  2.0
3  1.6  2.0
4  1.0  2.8
5  1.0  3.0
6  1.0  3.2
7  1.0  3.4
8  1.0  3.6
9  1.0  3.8

In [11]:
df1.mean()

A    1.12
B    2.78
dtype: float64

In [12]:
df1.mean(axis=1)

0    1.5
1    1.6
2    1.7
3    1.8
4    1.9
5    2.0
6    2.1
7    2.2
8    2.3
9    2.4
dtype: float64

In [13]:
df1.describe()

               A          B
count  10.000000  10.000000
mean    1.120000   2.780000
std     0.214994   0.726942
min     1.000000   2.000000
25%     1.000000   2.000000
50%     1.000000   2.900000
75%     1.150000   3.350000
max     1.600000   3.800000

In [14]:
df2 = pd.DataFrame({'etudiant':['A','B','C','A','B','C'], 'notes':np.random.randint(12,18,6)},columns=['etudiant','notes'])

In [15]:
df2

  etudiant  notes
0        A     17
1        B     17
2        C     14
3        A     15
4        B     15
5        C     15

In [16]:
df2.groupby('etudiant').sum()

          notes
etudiant
A            32
B            32
C            29

In [17]:
df2.groupby('etudiant').describe()

         notes
         count  mean       std   min    25%   50%    75%   max
etudiant
A          2.0  16.0  1.414214  15.0  15.50  16.0  16.50  17.0
B          2.0  16.0  1.414214  15.0  15.50  16.0  16.50  17.0
C          2.0  14.5  0.707107  14.0  14.25  14.5  14.75  15.0

In [36]:
# filtrer les etudiants dont les notes ont supÃ©rieures a 15
def fonction_filtre(v): return v['notes'].median() > 15

In [37]:
df2.groupby('etudiant').filter(fonction_filtre)

  etudiant  notes
0        A     17
1        B     17
3        A     15
4        B     15

In [39]:
moyennes = df2.groupby('etudiant').mean().add_prefix('moyenne_')
moyennes

          moyenne_notes
etudiant
A                  16.0
B                  16.0
C                  14.5